#include <stdio.h>

// 

int main() {
    // попросить ввести пользователя название файла с данными
    // проверить файл
    //
    // попросить ввести X
        // проверить ввод
        // если не ок, повторить
    // попросить ввести пользователя n
        // проверить ввод
        // если не ок, повторить
    // пройтись по X и найти два рядом стоящих x
    // проверить выходим ли мы за пределы таблицы
        // если все ок, то считаем
        // если не ок, то выводим сообщение, что происходит экстраполяция

    // находим

    // считаем y(X)

    printf("Hello, World!");
    return 0;
}
